<?php 
    $main_place = array(
    'круиз'=> array(0 => 'Италия', 1=>'Хорватия', 2=>'Швеция' ),
    'сафари'=> array(0 => 'Кения', 1=>'Марокко', 2=>'ЮАР' ),
    'гастротур'=> array(0 => 'Дания', 1=>'Норвегия', 2=>'Франция' ));

    $dop_service = array(
        'круиз'=> array(0 => 'развлечения', 1=>'сауна', 2=>'бассейн', 3=>'бар' ),
        'сафари'=> array(0 => 'экскурсии', 1=>'кормление животных', 2=>'фотоохота',3=> 'разделывание туши' ),
        'гастротур'=> array(0 => 'места', 1=>'местный рынок', 2=>'приготовление еды',3=> 'виноферма' ));
    $prices = array(
        'круиз'=>2000,
        'сафари'=>3000,
        'гастротур'=>1000,
        'завтрак'=>10,
        'ужин'=>20,
        'пансион'=>50,
        'Италия'=>200,
        'Хорватия'=>100,
        'Швеция'=>300,
        'Кения'=>500,
        'Марокко '=>300,
        'ЮАР'=>800,
        'Дания'=>50,
        'Норвегия'=>100,
        'Франция'=>80,
        'развлечения'=>0,
        'сауна'=>50,
        'бассейн'=>100,
        'бар'=>200,
        'экскурсии'=>0,
        'места'=>0,
        'кормление животных'=>100,
        'фотоохота'=>50,
        'разделывание туши'=>200,
        'местный рынок'=>50,
        'приготовление еды'=>200,
        'виноферма'=>100,
        ''=>''
    );
    function save_file($name, $email, $telephone, $country, $services, $taskOption, $eat_type)
{
    echo "helo";
    $filename = __DIR__ . '/' . $name . '_' . date('m-d-Y', time()) . '.txt';
    $text = "Имя: ".$name."\nEmail: ".$email."\nТелефон:".$telephone."\n\nТип путевки: ".$taskOption."\nТип питания: ".$eat_type."\nСтрана основного пребывания: ".$country."\nДополнительыне услуги: ".$services;
    file_put_contents($filename, $text);
}
function send($to)
{
    //$to      = 'nobody@example.com';
    $subject = 'the subject';
    $message = 'hello';
    //'From: webmaster@example.com'       . "\r\n" .
    $headers = 'From: '.$to       . "\r\n" .
        'Reply-To: webmaster@example.com' . "\r\n" .
        'X-Mailer: PHP/' . phpversion();

    mail($to, $subject, $message, $headers);
}
